{
	"version": "https://jsonfeed.org/version/1",
	"title": "Andrew Haglund",
	"icon": "https://micro.blog/haglund/avatar.jpg",
	"home_page_url": "https://haglund.app/",
	"feed_url": "https://haglund.app/feed.json",
	"items": [
		
			{
				"id": "http://haglund.micro.blog/2025/01/29/according-to-cnn-business-fear.html",
				
				"content_html": "<p>According to <a href=\"https://www.cnn.com/markets/premarkets\">CNN Business</a>, “Fear is driving the US market”</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "According to [CNN Business](https://www.cnn.com/markets/premarkets), “Fear is driving the US market”\n\n<img src=\"uploads/2025/52cf2b98a9.jpg\" width=\"600\" height=\"337\" alt=\"A green, wise-looking character with pointy ears, often associated with wisdom and teaching, appears contemplative.\">\n",
				"date_published": "2025-01-29T00:15:56-06:00",
				"url": "https://haglund.app/2025/01/29/according-to-cnn-business-fear.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/27/im-thankful-for-ben-thompsons.html",
				
				"content_html": "<p>I’m thankful for Ben Thompson’s <a href=\"https://stratechery.com/2025/deepseek-faq/\">FAQ about DeepSeek</a>. Lots of technical jargon but essentially a Chinese company made an open-source LLM on-par with OpenAI’s o1. They did so much more efficiently and despite the US chip restrictions. It signals that local/free AI is on the way.</p>\n",
				"content_text": "I’m thankful for Ben Thompson’s [FAQ about DeepSeek](https://stratechery.com/2025/deepseek-faq/). Lots of technical jargon but essentially a Chinese company made an open-source LLM on-par with OpenAI’s o1. They did so much more efficiently and despite the US chip restrictions. It signals that local/free AI is on the way.\n",
				"date_published": "2025-01-27T13:46:54-06:00",
				"url": "https://haglund.app/2025/01/27/im-thankful-for-ben-thompsons.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/23/trump-spent-the-week-blasting.html",
				
				"content_html": "<p>Trump spent the week blasting our checks and balances with a barrage of executive orders. The position has <em>always</em> been a quasi-monarch but never like this.</p>\n<p>I worry about LGBTQ and minorities whose leader believes they are nothing. I cannot fathom what these communities are going through.</p>\n",
				"content_text": "Trump spent the week blasting our checks and balances with a barrage of executive orders. The position has _always_ been a quasi-monarch but never like this.\n\nI worry about LGBTQ and minorities whose leader believes they are nothing. I cannot fathom what these communities are going through.\n",
				"date_published": "2025-01-23T23:51:25-06:00",
				"url": "https://haglund.app/2025/01/23/trump-spent-the-week-blasting.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/23/a-few-ways-tvos-could.html",
				"title": "A Few Ways tvOS Could Improve",
				"content_html": "<p>I’ll probably submit these items as “official” feedback items to Apple but in the meantime here are a few things I noticed tonight while using my beloved Apple TV running tvOS watching Apple TV+ shows. This is a platform I use <em>every night</em> and I want it to be better.</p>\n<h2 id=\"first-some-praise\">First some praise</h2>\n<p>You’ve always been able to say “what did they say?” to the remote and it would rewind 10 seconds and turn on the captions for a few seconds. Incredible feature.</p>\n<p>Now in tvOS 18 the same thing happens when you click the left button. No need to talk, just click.</p>\n<p>It’s an <em>tiny</em> improvement but I know so many people will benefit from this, especially with shows like <em>All Creatures Great and Small</em>. The world would be a much better place if companies focused on sanding off the hard edges and just made things <em>nicer</em>.</p>\n<p>(Unrelated but using a pair of HomePods with your TV is incredible. That is until it randomly loses connection. It doesn’t happen too often but it feels impossible to recover from.)</p>\n<h2 id=\"apple-tv-plus\">Apple TV Plus</h2>\n<ul>\n<li>Stop spoiling massive season 1 mysteries in your season 2 pre-roll promos. What is hell is wrong with you? (Referring to both <em>Silo</em> and <em>Severance</em>.)</li>\n<li>You don’t need to tell me to watch shows I’m already watching.</li>\n</ul>\n<h2 id=\"tvos\">tvOS</h2>\n<ul>\n<li>It’s impossible to see who directed specific episodes of a TV show. (How do I know which episodes Ben Stiller directed of <em>Severance</em>?)</li>\n<li>Cast &amp; Crew should be separate rows to better highlight directors, producers, writers, costume, etc. The list of actors (especially on shows) can be endless and there’s so many <em>other</em> people that come together to make film and TV.</li>\n<li>Rotten Tomatoes scores are shown for movies but not TV. First: it’s a crass way to judge art. Second: you could lose many nights to a bad show but a bad movie is… 2 hours? Third: RT offers distinct Critic and Audience scores, which can be useful.</li>\n<li>This doesn’t happen often but sometimes the Match Frame Rate setting gets stuck: I’ll finish an episode and the tvOS UI will keep running at 24fps instead of buttery 60. Horrendous and hard to fix.</li>\n</ul>\n",
				"content_text": "I’ll probably submit these items as “official” feedback items to Apple but in the meantime here are a few things I noticed tonight while using my beloved Apple TV running tvOS watching Apple TV+ shows. This is a platform I use _every night_ and I want it to be better.\n\n## First some praise\nYou’ve always been able to say “what did they say?” to the remote and it would rewind 10 seconds and turn on the captions for a few seconds. Incredible feature.\n\nNow in tvOS 18 the same thing happens when you click the left button. No need to talk, just click.\n\nIt’s an _tiny_ improvement but I know so many people will benefit from this, especially with shows like _All Creatures Great and Small_. The world would be a much better place if companies focused on sanding off the hard edges and just made things _nicer_.\n\n(Unrelated but using a pair of HomePods with your TV is incredible. That is until it randomly loses connection. It doesn’t happen too often but it feels impossible to recover from.)\n\n## Apple TV Plus\n- Stop spoiling massive season 1 mysteries in your season 2 pre-roll promos. What is hell is wrong with you? (Referring to both _Silo_ and _Severance_.)\n- You don’t need to tell me to watch shows I’m already watching.\n\n## tvOS\n\n- It’s impossible to see who directed specific episodes of a TV show. (How do I know which episodes Ben Stiller directed of _Severance_?)\n- Cast & Crew should be separate rows to better highlight directors, producers, writers, costume, etc. The list of actors (especially on shows) can be endless and there’s so many _other_ people that come together to make film and TV.\n- Rotten Tomatoes scores are shown for movies but not TV. First: it’s a crass way to judge art. Second: you could lose many nights to a bad show but a bad movie is… 2 hours? Third: RT offers distinct Critic and Audience scores, which can be useful.\n- This doesn’t happen often but sometimes the Match Frame Rate setting gets stuck: I’ll finish an episode and the tvOS UI will keep running at 24fps instead of buttery 60. Horrendous and hard to fix.\n",
				"date_published": "2025-01-23T23:15:43-06:00",
				"url": "https://haglund.app/2025/01/23/a-few-ways-tvos-could.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/18/ive-been-trying-not-to.html",
				
				"content_html": "<p>I’ve been trying not to drink on weeknights. It doesn’t always work.</p>\n",
				"content_text": "I’ve been trying not to drink on weeknights. It doesn’t always work.\n",
				"date_published": "2025-01-18T23:00:11-06:00",
				"url": "https://haglund.app/2025/01/18/ive-been-trying-not-to.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/18/with-tiktok-gone-the-youth.html",
				"title": "With TikTok gone, the youth looked upon sky and toucheth the grass and it was very good.",
				"content_html": "<p>This TikTok ban is complete bullshit. From everything I’ve read this is pure rah-rah anti-China. Yes TikTok is <em>100%</em> a propaganda factory and its algorithm is dangerous but so is Facebook, Instagram, and Twitter.</p>\n<p>If you care about the problems this ban <em>purports</em> to solve we need genuine algorithm, privacy, and data laws to protect the citizens of the U.S. of A. — which would <em>just so happen</em> to include TikTok. This of course would take down too many U.S.-based morally-bankrupt ad-tech, data broker, and social media companies. So yeah, let’s just turn a blind eye to that and let’s just focus on this one Chinese company in particular.</p>\n<p>It’s also a call to action to build alternatives to the giants (projects like <a href=\"https://loops.video\">loops.video</a> spring to mind). To all of you out there who consider yourself a “content creator”: take your videos and share them on the web. Don’t let your livelihood be subject to a single algorithm <em>that can’t control</em>.</p>\n<p>As much as I despise at the term “content creator” (come on, it <em>completely</em> devalues your work) I do feel bad for these people caught in the crosshairs here. These people built an audience on TikTok and they just lost their entire network of followers. Imagine running a bakery and you had to change locations overnight but you have no means of telling your regulars — talk about putting all your breads in one basket.</p>\n<p>The internet is vast and wild. Get out of the silos.</p>\n",
				"content_text": "This TikTok ban is complete bullshit. From everything I’ve read this is pure rah-rah anti-China. Yes TikTok is _100%_ a propaganda factory and its algorithm is dangerous but so is Facebook, Instagram, and Twitter.\n\nIf you care about the problems this ban _purports_ to solve we need genuine algorithm, privacy, and data laws to protect the citizens of the U.S. of A. — which would _just so happen_ to include TikTok. This of course would take down too many U.S.-based morally-bankrupt ad-tech, data broker, and social media companies. So yeah, let’s just turn a blind eye to that and let’s just focus on this one Chinese company in particular.\n\nIt’s also a call to action to build alternatives to the giants (projects like [loops.video](https://loops.video) spring to mind). To all of you out there who consider yourself a “content creator”: take your videos and share them on the web. Don’t let your livelihood be subject to a single algorithm _that can’t control_.\n\nAs much as I despise at the term “content creator” (come on, it _completely_ devalues your work) I do feel bad for these people caught in the crosshairs here. These people built an audience on TikTok and they just lost their entire network of followers. Imagine running a bakery and you had to change locations overnight but you have no means of telling your regulars — talk about putting all your breads in one basket.\n\nThe internet is vast and wild. Get out of the silos.\n",
				"date_published": "2025-01-18T22:47:05-06:00",
				"url": "https://haglund.app/2025/01/18/with-tiktok-gone-the-youth.html"
			},
			{
				"id": "http://haglund.micro.blog/2025/01/16/rip-david-lynch-great-obituary.html",
				"title": "RIP David Lynch",
				"content_html": "<p>RIP David Lynch. <a href=\"https://variety.com/2025/film/news/david-lynch-dead-director-blue-velvet-twin-peaks-1236276106/\">Great obituary</a> from Variety and <a href=\"https://www.rogerebert.com/tributes/have-a-great-day-david-lynch-1946-2025\">RogerEbert.com</a> (via <a href=\"https://daringfireball.net/linked/2025/01/16/david-lynch-rip\">Gruber</a>). I love his work in  <em>Twin Peaks</em> (both as director and Gordon Cole, “Coop!”). I first saw his unsettling films <em>Eraserhead</em> and <em>Blue Velvet</em> years ago, but I still need to see <em>Elephant Man</em> and <em>Mulholland Drive</em>.</p>\n<p>From Kyle MacLachlan (<a href=\"https://www.instagram.com/p/DE5pC5RyH29/\">on Instagram</a>):</p>\n<blockquote>\n<p>Forty-two years ago, for reasons beyond my comprehension, David Lynch plucked me out of obscurity to star in his first and last big budget movie. He clearly saw something in me that even I didn’t recognize. I owe my entire career, and life really, to his vision.</p>\n</blockquote>\n<p>What an artist.</p>\n",
				"content_text": "RIP David Lynch. [Great obituary](https://variety.com/2025/film/news/david-lynch-dead-director-blue-velvet-twin-peaks-1236276106/) from Variety and [RogerEbert.com](https://www.rogerebert.com/tributes/have-a-great-day-david-lynch-1946-2025) (via [Gruber](https://daringfireball.net/linked/2025/01/16/david-lynch-rip)). I love his work in  _Twin Peaks_ (both as director and Gordon Cole, “Coop!”). I first saw his unsettling films _Eraserhead_ and _Blue Velvet_ years ago, but I still need to see _Elephant Man_ and _Mulholland Drive_.\n\nFrom Kyle MacLachlan ([on Instagram](https://www.instagram.com/p/DE5pC5RyH29/)):\n\n> Forty-two years ago, for reasons beyond my comprehension, David Lynch plucked me out of obscurity to star in his first and last big budget movie. He clearly saw something in me that even I didn’t recognize. I owe my entire career, and life really, to his vision.\n\nWhat an artist.\n",
				"date_published": "2025-01-16T15:17:08-06:00",
				"url": "https://haglund.app/2025/01/16/rip-david-lynch-great-obituary.html"
			}
	]
}
